In [71]:
import pandas as pd

In [54]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [55]:
titles = pd.DataFrame.from_csv('data/titles.csv', index_col=None)
cast = pd.DataFrame.from_csv('data/cast.csv', index_col=None)

In [56]:
type(titles)

pandas.core.frame.DataFrame

In [57]:
type(titles.title)

pandas.core.series.Series

In [58]:
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [59]:
cast.tail()

,title,year,name,type,character,n
3499555,Stuttur Frakki,1993,Sveinbj?rg ??rhallsd?ttir,actress,Flugfreyja,24.0
3499556,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3499557,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3499558,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3499559,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [60]:
titles.columns

Index([u'title', u'year'], dtype='object')

In [61]:
titles['title'].head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [62]:
titles.title.head()

0             The Rising Son
1    The Thousand Plane Raid
2           Crucea de piatra
3                    Country
4                 Gaiking II
Name: title, dtype: object

In [63]:
titles.count()

title    225616
year     225616
dtype: int64

In [64]:
titles.sort_values('title').head()

                        title  year
138980       #1 Serial Killer  2013
158682                     #5  2013
84531              #50Fathers  2015
70275                     #66  2015
63318   #73, Shaanthi Nivaasa  2007

In [65]:
titles.sort_values('year').head()

                                                    title  year
172508                                         Miss Jerry  1894
120909     Reproduction of the Corbett and Jeffries Fight  1899
92240                            Trouble in Hogan's Alley  1900
19987   Pierrot's Problem, or How to Make a Fat Wife O...  1900
178104                              Soldiers of the Cross  1900

In [72]:
cast.sort_values('year').head()

,title,year,name,type,character,n
2439108,Miss Jerry,1894,Blanche Bayliss,actress,Miss Geraldine Holbrook (Miss Jerry),NaN
539261,Miss Jerry,1894,Chauncey Depew,actor,Himself - the Director of the New York Central...,NaN
450822,Miss Jerry,1894,William Courtenay,actor,Mr. Hamilton,NaN
1667235,Soldiers of the Cross,1900,Reg Perry,actor,Lion,NaN
1667084,Soldiers of the Cross,1900,Orrie Perry,actor,Lion,NaN

In [74]:
titles.title == 'Hamlet'

0         False
1         False
2         False
3         False
4         False
5         False
6         False
7         False
8         False
9         False
10        False
11        False
12        False
13        False
14        False
15        False
16        False
17        False
18        False
19        False
20        False
21        False
22        False
23        False
24        False
25        False
26        False
27        False
28        False
29        False
          ...
225586    False
225587    False
225588    False
225589    False
225590    False
225591    False
225592    False
225593    False
225594    False
225595    False
225596    False
225597    False
225598    False
225599    False
225600    False
225601    False
225602    False
225603    False
225604    False
225605    False
225606    False
225607    False
225608    False
225609    False
225610    False
225611    False
225612    False
225613    False
225614    False
225615    False
Name: title, dtype: bool

In [84]:
titles[(titles.title == 'Hamlet') | (titles.title == 'The Rising Son')].head(50)

                 title  year
0       The Rising Son  1990
5807            Hamlet  1948
27270           Hamlet  2016
38985           Hamlet  2015
45362           Hamlet  1910
71187           Hamlet  1954
89479           Hamlet  1976
91616           Hamlet  1987
91815           Hamlet  2000
95729           Hamlet  1921
119166          Hamlet  1969
161443          Hamlet  1913
170859          Hamlet  2009
177569          Hamlet  1964
195396          Hamlet  1996
201507          Hamlet  2011
203801          Hamlet  1911
215074          Hamlet  1973
216727          Hamlet  1990
217129          Hamlet  2014